{
  "13": {
    "uid": "33c29188f146",
    "title": "Sintra for Cosplay: What is it and what do you need to use it",
    "author": "Fabricatordjinn",
    "date": "Nov 18, 2015",
    "catergory": "General",
    "image": "",
    "description": "I recently debuted an Imperius costume from Diablo 3 at Blizzcon 2015. I have received an enormous amount of feedback on this costume, and the most common question I’ve received is 'What did you make that out of, how did you get it so smooth!'

    Well, here is your answer.
    
    I used a type of thermoplastic called Closed Cell PVC Foam, more commonly known as Sintra (brand) or XPVC. XPVC is sort of a hybrid between PVC (like the pipes) and Polyurethane. This mix gives it some truly amazing properties, and makes it surprisingly friendly to use for a thermoplastic. I starts out almost totally smooth, and sands to a near perfect finish. It takes all types of paint, and is by far my favorite material to work with.
    
    It is heat shapable, sandable, cuttable by hand or with a saw, drillable, comes in various colors and thicknesses and is in general a wonderfully versatile material to work with. I have even successfully turned it on a lathe. It is commonly used in the FX industry and for vinyl coated signs you see on the street.
    
    Instead of going into the technical minutia of XPVCs properties, I have included a link to the Wikipedia article on it HERE.
    
    That’s nice you say, what do I need to start?
    
    Things you need:
    
    XPVC:  Sintra/Komatex/Celtec (USA) – Forex (UK/AUS) – Link to good price on Amazon
    
    First you need to find it. I get all of my XPVC from a local vendor called San Diego Plastics. It is only really sold by industrial plastic suppliers. If you live near a city, there is likely somewhere nearby that sells it. It comes in 8’x4’ sheets that cannot easily be rolled. I recommend cutting it down to 2’x4’ chunks if you find a local supplier and they allow it. If you cannot find anything locally or want to try your hand at some of it, you can always purchase it from Amazon. If you have trouble finding it, call your local sign maker and ask where he gets his plastic. They might be able to point you in the right direction.
    
    X-acto Knife/Boxcutter:
    
    The X-acto knife is my preferred method of cutting XPVC. The thin blades give you the most control, and the finger grip makes doing more intricate cuts possible on thick material. A box cutter works, but theres not much that beats a good x-acto. The one I use is an X-Acto X3000 Knife with Cap, Black (X3730Q) and the blades I use are Techni Edge #11 Hobby Blades – 100 Pack. You go through blades pretty quick, but at $11 for 100 blades.. who cares.
    
    Respirator (Fume Rated):
    
    This section is in bold because I’m not messing around here. This stuff is quite safe up until you sand it or apply heat to it. The dust is mildly toxic, if you’re going to sand it, wear a respirator you don’t want it in your lungs. When heated to the point you can shape it, this stuff releases HYDROGEN CHLORIDE GAS which when inhaled will turn into HYDROCHLORIC ACID and seriously wreck your insides. Do not disrespect this material or forgo the mask stage, it is not worth it. Heat it in a well ventilated or outdoor space, put your pets in another room, and wear your fume rated respirator for the entire duration of heating the material. The gas lingers for a bit after heating, just invest in a comfortable mask and you’ll be fine. MINIMUM RECOMMENDED RESPIRATOR: 3M Paint Project Respirator, Medium
    
    Heat Gun:
    
    Any standard heat gun will work here. If you build costumes, you likely already have one of these, otherwise you can pick one up at Harbor Freight for $15, or through amazon. The one I use is the Wagner 0503008 HT1000 1,200-watt Heat Gun, which has both high and low settings and gets QUITE hot. Make sure to follow proper safety precautions when heating XPVC, because if you dont the fumes can kill you or cause permanent brain damage. Don’t risk it, wear a respirator.
    
    Superglue:
    
    Thats right, Superglue. This is by far the best adhesive for XPVC/Sintra. Any type of “CA” glue will work, you can also use hotglue or barge or whatever you want, but to me.. superglue is king. Superglue will melt both sides of the sintra you are gluing together, creating what is essentially a chemical weld between the two surfaces that is stronger then the material itself. These bonds are permanent, and you will have to likely destroy parts of your prop to separate them, so be careful you know where you want it to go when you glue it together. You have maybe 5-10 seconds depending on the glue you use to place it before it will never move again. The best superglue I have found for this by far is Loctite 20-Gram Bottle Liquid Professional Super Glue, it sets in 5-10 seconds, flows very well, you get a lot of it for the price and it sands very smooth. Highly recommended out of the 15 or so types I’ve tried.
    
    Basic Techniques:
    
    XPVC is quite similar to other thermoplastics or foams to work with. If you’re familiar with techniques for how to cut and shape foam or worbla, most all of those techniques will apply here. Except with PVC you dont need to coat it with anything, its already rigid and ready for paint. You can fill seams with anything, it is very forgiving. I made a short video below demonstrating some of the more unique or interesting properties of sintra, and may be working on a book full of techniques for cosplay use of this material.. until then check out the video below and try it out! More videos to come, including a tutorial on how to use this material to make a simple shoulder guard."
  },
  "12": {
    "uid": "3592bb1ab925",
    "title": "Warcraft: Gorehowl – The Axe of Grom Hellscream",
    "author": "Fabricatordjinn",
    "date": "Aug 22, 2015",
    "catergory": "General",
    "image": "",
    "description": "Gorehowl was and still is one of my favorite fantasy weapons of all time. Its just so brutal and simple, a huge ass cleaver that has slain demigods, demons, and countless enemies of its wielder. I decided to build one on a whim awhile ago, and here are the results! .. Lok’tar Ogar? I wanted to do the OG version this time, not the Iron Horde version. So I installed WoW again and got to model ripping. After a bit of tinkering, I had the model and a solid size reference. Yes. Good. I scaled it up to my size, and found it should be just a little over 4′ long total for maximum choppiness. I booted up pepakura viewer, got a solid size profile of my model and printed out a rough template for the blade. Then, I transferred this pattern to a 1″ thick chunk of Expanded PVC I had been lucky enough to find in the scrap bin for $10 (usually $200+ a sheet). I planned to make the entire back of the axe removable (with screws for reinforcement) until final sealing up, so I bandsawed off the back 2 inches of the blade for later. I created my blade lines with my template and a lot of model turning, then transferred those lines to the new blade blank. At this point, it was time to take the blade blank to the belt sander/orbital sander. this was the first time I had tried to sand out the blade of such a thick and solid chunk of plastic.. and it was just incredibly slow going and tiring...."
  },
  "11": {
    "uid": "ed06f52ca627",
    "title": "Warhammer 40k: Nemesis Force Sword",
    "author": "Fabricatordjinn",
    "date": "May 14, 2015",
    "catergory": "Commissions",
    "image": "",
    "description": "Going through my backlog of builds, this one was one of my favorites! I built this sword back when I was still in Hawaii, and it was one of my very first commissions! A Grey Knight Nemesis Force Sword! I can feel the nerd in me shivering with joy already. Lets get to smiting. After digging around, I found some reference art with a design I REALLY liked by Kano Kun. Simple in shape, devastating in effect. Since this was to be a 1 handed weapon, it needed to be on the lighter side so I decided to build it out of Extruded Polystyrene Foam Board. I then drew up a blade shape I liked, and got to cutting! After drawing my blade lines, it was time to get sanding! I bust out the trusty old Random Orbit Hand Sander and went to work. Foam like this sands like it isnt even there so about 20 minutes later.. It was my first time working with this material, and I didn’t fare too well in the control department. there were too many problems with the blade so I cut out another blank and redid the edges. Much cleaner! I was using my dads shop at this point, so I had access to tools beyond even what I have available now! I bought a 1″ dowel rod and ran it through a planer to flatten out the sides to the width of the blade.. I was then able to cut a channel out of the foam blade and insert the wooden piece in, making it endlessly durable to hefting about and..."
  },
  "10": {
    "uid": "aebfc1b949b8",
    "title": "League: Trundles Ice Mace “Clubbems",
    "author": "Fabricatordjinn",
    "date": "May 4, 2015",
    "catergory": "Commissions",
    "image": "",
    "description": "I was approached by Riot to make a full sized Trundle Ice mace for their upcoming YouTube show, /ALL/ Chat. You can see it adorning their weapon wall along with a number of other excellent stabbing/bashing tools. I only had 2 weeks from their first email to show day, so I had to build this very quickly. Having never done a prop with so much.. MASS before, I had to come up with a quick and effective way to make it lightweight, strong, and use what I had available immediately. I wanted to make it out of Insulation foam, but there was decidedly little of it on hand in Sunny San Diego and I had to go with an old staple, Pepakura! This was the goal! I dug into the game files and pulled out the model for Clubbems, and quickly turned it into a useable pep file (I have included this file below for any who want to use it!) Trundle Ice Mace – Pep File I had to make this thing strong, and cardstock just wasnt going to cut it. The finished version of Clubbems has deep cracks, gouges and blemishes in its face that would require me to take a lot of material out to make believable. Since foam wasnt available, I decided to use 3mm Expanded PVC as my pepakura base. After getting my file ready, I printed out to paper, cut out, transferred to PVC and labelled each face. Yes this was exactly as tedious and mind numbing as it looks. There was a lot of beer involved. Bless audiobooks. After this process, I..."
  },
  "9": {
    "uid": "e0b16a1737ab",
    "title": "Imperius: Crown of Heaven (Helmet)",
    "author": "Fabricatordjinn",
    "date": "Mar 13, 2015",
    "catergory": "Personal Projects",
    "image": "",
    "description": "This helmet in my mind is one of the most challenging pieces of the outfit, and thats saying something! Heres what I had to deal with. I started by pulling the helmet shape from the in game model to get the basic shape. After ripping it apart I made a 2 piece template that would fold together into the shape of the whole helmet all at once. There was a lot of trial and error involved in this, but having a model helped immeasurably. In the end, I transferred my base pattern to 3mm PVC and cut each half out. They might be the craziest looking patterns ive ever used! Using a heat gun, I slowly heated up and bent the plastic to the shape of the helmet, using the pattern to meet edges and generally fightin with it for awhile. After a very long time tweaking and gluing, this is what I had. Complicated helmet base in a day! Obviously the tape couldnt stay forever, I glued it all together, then to make it a solid peice I mixed fiberglass resin, PVC dust (from my orbital) and bondo together to make a thick sludge, then slushed it around on the inside of the helmet. There is about a 2mm coat of the stuff holding it all together in there. After it dried, the helmet was rock solid and I could sand and fill it to kingdom come to get rid of those peaks and fold marks. This was a lot of boring sanding, but in the end I got a much cleaner helmet base that was quite strong...."
  },
  "8": {
    "uid": "b3181e05af7f",
    "title": "League: Dunkmaster Darius Baxeboard",
    "author": "Fabricatordjinn",
    "date": "Jan 19, 2015",
    "catergory": "Commissions",
    "image": "",
    "description": "Dunking fools? Yes please. Heres a fun little side project I did for Riot. You can see the axe leaning against the wall in this cool video they made (All Chat). It may also serve another, more mysterious purpose sometime in the future. OOOOOooooOoOoOoo. In any case, here it is! The Dunkmaster Darius Battleaxe. First things first, I decided on a size (6’4″) and scaled the head to match, transferring this to paper as a template. I got this image from the Texture file, ripped directly from the game files. After cutting the shape out, I transferred it to 3/8ths inch Expanded PVC and cut a pair of them out for the main body. Due to its size, it simply had to be hollow. After cutting these sections out, I sandwiched a number of insulation foam sheet chunks in-between the two halves to give it some sturdiness and stability, as-well as an even level throughout. It worked pretty well! This is standard 1.5″ insulation foam, giving it a roughly 2″ thickness with the PVC sheets on top of it. Next up, I sealed it all together with very long strips of 2mm PVC, including the inner decapitation area. This whole process was very clean and the only sanding required really was on the damaged area and gap filling with some Apoxie sculpt and filler primer. All said and done, the base of the head weighed a whopping 2 pounds and was a little over 2.5′ across. Time to move on to the pole! Enter everyone’s favorite tool – the home depot plumbing section! I decided to use 2.5″ and..."
  },
  "7": {
    "uid": "229d81100de0",
    "title": "Imperius: Gauntlets of Valor",
    "author": "Fabricatordjinn",
    "date": "Dec 8, 2014",
    "catergory": "Personal Projects",
    "image": "",
    "description": "Next up, the gauntlets! Or at least the upper section. I started as usual, with the base model from the game. After unfolding it and making some templates for the pieces that worked, BS’ing the pieces that didn’t, I transferred it all to plastic and cut out the base. For some reason I didn’t start taking pictures until the lowest level shell was done and everything was cut out, so here it is. After this, I cut out some trim (pictured), mounted it all in place, and heat shaped the lower sections to the open ended shape they are in the cinematic. These are very strange gauntlets. With that section mostly complete, it was time to start on the detailed top section. Using a template made from the pep file I created, I forced together the awkward shape of the top sections using a heat gun and lots of superglue/sanding. After that, I designed the detail that would go on the outside, planning to cut it out and build it up layer by layer. This was a tedious process, but ended up with some pretty good results! The first layer went down, and a bit of apoxie scult was used to fill the gap. Then, sanding.   Then, another layer (designed from the previous template), went down ontop of the first, to add those cool looking levels. A coat of primer and some more sanding, because why not. Now it is time for the inner detailing! I couldn’t bring myself to use pre bought stuff on this, and sat down and drew out the inner detailing on one of..."
  },
  "6": {
    "uid": "e1ce542e56d8",
    "title": "Imperius: Shoulder Guards",
    "author": "Fabricatordjinn",
    "date": "Dec 6, 2014",
    "catergory": "Personal Projects",
    "image": "",
    "description": "Ahhh Imperius, you wide bastard. These bad boys were fun to make, and where my first foray into making an actual silicone mold. Without further ado! Using the models I ripped from D3, I made a properly sized template out of pep for the base, and after transferring it to plastic and a lot of heat shaping (of which there are no pictures), I made these! God these were ugly and unwieldy, and cleaning them up was a nightmare because of the low res of the model and the thickness of the PVC (3mm). I decided to focus all my energy on making one shoulder to mold instead of all 4 big chunks. I started by patterning out the detailing on each side, and cutting it out of 2mm PVC. This was a mostly trial and error process involving a lot of cursing and measuring.   After this, I added the outer trim detailing, and built up the top using Apoxie Sculpt. Lots of sanding here, as usual. LEARN TO LOVE THE SANDING. To finish it off, I used another piece of 3mm PVC and sanded it into the curvy beveled shape in the cross bit. For some reason I do not have pictures of this hand sanding process, but it was all done with the random orbit sander. After this, it was finish sanding and.. mold making! Sloppy first run, this whole thing ended up being garbage and I had to redo it. Valuable lessoned learned, namely take your time, and FILL ALL YOUR SEAMS. After another try, my one peice mold was complete.. and it was time..."
  },
  "5": {
    "uid": "68d2168f6816",
    "title": "Imperius: Breastplate (continued!)",
    "author": "Fabricatordjinn",
    "date": "Dec 4, 2014",
    "catergory": "Personal Projects",
    "image": "",
    "description": "Hey all, I’m not dead, just lazy! I haven’t been keeping this page current with my progress, shame on me! Time to start the long process of fixing that. Here is part 2 of the breastplate boogaloo. Imperius has a thing for the Sun, it seems. . I wasn’t sure how exactly to build this, so I just started from the lowest level and went to work! I roughed out the shape below after a bit of trial and error, and cut the first layer out of 2mm PVC. And two more layers, designed by bullshit and guesswork. from this point, I glued these pieces together, then filled every gap with Apoxie sculpt to create the bevels and sanded it for ages. After much pondering on how to get this thing I have created to curve so splendidly, I made my choice and cut this thing I had just completed right in half. After more filling, sanding, and cursing, the finished cleaned up master was ready for my dumb idea! I made Vacuform pulls of both halves of the chest piece, and cut out the Vac formed halves. Perfecto! Oh wait, nevermind, you cant bend a hollow object without horrifying warping. I scrapped that idea for another one, and filled both halves of the vac pull with that same cheap fiberglass resin I used for the Spears sun. I didnt get any photos of this process as I pulled the resin out of the “molds” before it had fully cured, and quickly bent the 90% cured resin to shape with a heat gun and my hands, then screwed it..."
  },
  "4": {
    "uid": "271831235d6c",
    "title": "Warhammer 40k: Runed Frost Axe",
    "author": "Fabricatordjinn",
    "date": "May 15, 2013",
    "catergory": "Commissions",
    "image": "",
    "description": "I’ve always been a fan of vikings, so when I got this commission to build a Space Wolves frost axe I was all over it. Emperor be praised lets get to cleaving. I started digging around, and found an old Power Axe pepakura model someone made (if anyone knows who did let me know! it was years ago!). I decided to use this as my axe head base. I scaled it up to a 2 handed axe size, and got to work assembling the blade. It is a very simple design so the blade came together very rapidly. At this point I was still using paper (USE PLASTIC ITS AWESOME). Now dats a choppa (wait.. ) After I built the paper version and resin covered it, It still wasnt sturdy enough to stop itself from warping so I had to cut it open and reinforce the inside with HIPS (High Impact Polystyrene) I also cut two channels out of the front part of the axe to give me a space to do lighting for the “runed” part of this prop. After this was sturdy, I cut out Plexiglass pieces to fit into the channel I had cut out near the front of the blade on either side. I set these into the gaps and filled the seals with glue and bondo, sanding it flush (and making the plexiglass frosted in the process). Light could now pass through the axe tip easily! This picture was it just being held in front of a light. At this point it was time to add the lighting. I had the idea of making..."
  },
  "3": {
    "uid": "f34167f3e4ba",
    "title": "Imperius : Breastplate WiP",
    "author": "Fabricatordjinn",
    "date": "Jan 28, 2013",
    "catergory": "Commissions",
    "image": "",
    "description": "This is probably the only build I’m going to be able to do this year.. so I’m going all out on it. Cinematic version or bust. After ripping the games model (as a base) and breaking down the armor into parts, I started making the breastplate today. After what felt like way too long of a time planning and tinkering with templates, I figured out what I wanted and cut the template out. Turned out being only 4 pieces in the end. And then the test taping! Much cleanup and work will go into this tomorrow. Glad to finally be working on this again. This chest has a lot of layers, as seen here: I started by sealing up the top and reinforcing the hell out of the inside/outside of the first collar using fiberglass and rondo – That first layer is going NOWHERE. I then started tinkering with adding the 2nd layer of collars. Then the third Then the bottom first layer and back segment. I will be designing the sun on the front tonight and tomorrow.. then I have to actually make it. After that its a whole hell of a lot of trim and cleaning – but I’m happy with the direction its going so far! The screws are incredibly temporary, needed a reliable way to keep the plates in place while I templated out the next bit while still being able to remove them..."
  },
  "2": {
    "uid": "f5b736613a14",
    "title": "Solarion : Spear of Valor (Part 1)",
    "author": "Fabricatordjinn",
    "date": "Aug 29, 2012",
    "catergory": "Personal Projects",
    "image": "",
    "description": "In preparation for my upcoming Archangel Imperius build, I am making the spear he uses throughout Diablo 3. This is what I was trying to build. This is what I actually built. Below is a rough outline of the steps I took to create this spear! Using my scaled ingame model as a reference, I made some templates and cut the basic shape of the main blades out of 3/4ths inch thick Expanded PVC (Sintra). Found a scrap of the stuff big enough to host the blades for $8, score. The next step was to take this and get sanding. After marking a line down the center of the plastic where I wanted the edge to be and blocking off the areas where the edge stopped (I used painters tape as a physical barrier ontop of the lines you see.. this is extremely helpful in stopping accidental deviations) I began my dark and prolonged work with the belt sander and orbital. These blades are a little over 2′ long. This spear will be large. A little crooked, but not bad for a first pass. Edge takes shape, this process took about 40 minutes per blade. Thankfully I only had to do this step once. This plastic was harder then I expected.. perhaps it was not sintra after all. First pass complete! Looking pretty smooth. Drew up a template for the inner blades and started working on the circular plate the sun shape sits on. I ended up making a vac pull of a small food plate I found and cutting the plastic version to the size I wanted. Using..."
  },
  "1": {
    "uid": "efb45c9c6b23",
    "title": "Airsoft Bolt Pistol",
    "author": "Fabricatordjinn",
    "date": "Apr 4, 2011",
    "catergory": "Personal Projects",
    "image": "",
    "description": "In preparation for my upcoming Archangel Imperius build, I am making the spear he uses throughout Diablo 3. This is what I was trying to build. This is what I actually built. Below is a rough outline of the steps I took to create this spear! Using my scaled ingame model as a reference, I made some templates and cut the basic shape of the main blades out of 3/4ths inch thick Expanded PVC (Sintra). Found a scrap of the stuff big enough to host the blades for $8, score. The next step was to take this and get sanding. After marking a line down the center of the plastic where I wanted the edge to be and blocking off the areas where the edge stopped (I used painters tape as a physical barrier ontop of the lines you see.. this is extremely helpful in stopping accidental deviations) I began my dark and prolonged work with the belt sander and orbital. These blades are a little over 2′ long. This spear will be large. A little crooked, but not bad for a first pass. Edge takes shape, this process took about 40 minutes per blade. Thankfully I only had to do this step once. This plastic was harder then I expected.. perhaps it was not sintra after all. First pass complete! Looking pretty smooth. Drew up a template for the inner blades and started working on the circular plate the sun shape sits on. I ended up making a vac pull of a small food plate I found and cutting the plastic version to the size I wanted. Using..."
  }
}
